"""
Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты высажены только по окружности. 
Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, 
находясь перед некоторым кустом заданной во входном файле грядки.
"""


from random import randint

kust = list(randint(1, 100) for i in range(int(input("Введите кол-во кустов: "))))
result = []
i = 0
print(kust)

while i < len(kust):
    if i == len(kust) - 1:
        sum = kust[i] + kust[i - 1] + kust[0]
    else:
        sum = kust[i] + kust[i - 1] + kust[i + 1]
    result.append(sum)
    i += 1

print(f"максимальное число ягод {sorted(result)[-1]}")

